ciaa/firmware_v1/externals/drivers/cortexM4/k60_120/inc/MK60F12_extension.h
/*******************************************************************************
 * ENET_EIR - Interrupt Event Register
 ******************************************************************************/

/*!
 * @brief ENET_EIR - Interrupt Event Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * When an event occurs that sets a bit in EIR, an interrupt occurs if the
 * corresponding bit in the interrupt mask register (EIMR) is also set. Writing a 1 to
 * an EIR bit clears it; writing 0 has no effect. This register is cleared upon
 * hardware reset. TxBD[INT] and RxBD[INT] must be set to 1 to allow setting the
 * corresponding EIR register flags in enhanced mode, ENET_ECR[EN1588] = 1.
 * Legacy mode does not require these flags to be enabled.
 */
/*!
 * @name Constants and macros for entire ENET_EIR register
 */
/*@{*/
#define ENET_RD_EIR(base)        (ENET_EIR_REG(base))
#define ENET_WR_EIR(base, value) (ENET_EIR_REG(base) = (value))
#define ENET_RMW_EIR(base, mask, value) (ENET_WR_EIR(base, (ENET_RD_EIR(base) & ~(mask)) | (value)))
#define ENET_SET_EIR(base, value) (ENET_WR_EIR(base, ENET_RD_EIR(base) |  (value)))
#define ENET_CLR_EIR(base, value) (ENET_WR_EIR(base, ENET_RD_EIR(base) & ~(value)))
#define ENET_TOG_EIR(base, value) (ENET_WR_EIR(base, ENET_RD_EIR(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual ENET_EIR bitfields
 */

/*!
 * @name Register ENET_EIR, field TS_TIMER[15] (W1C)
 *
 * The adjustable timer reached the period event. A period event interrupt can
 * be generated if ATCR[PEREN] is set and the timer wraps according to the
 * periodic setting in the ATPER register. Set the timer period value before setting
 * ATCR[PEREN].
 */
/*@{*/
/*! @brief Read current value of the ENET_EIR_TS_TIMER field. */
#define ENET_RD_EIR_TS_TIMER(base) ((ENET_EIR_REG(base) & ENET_EIR_TS_TIMER_MASK) >> ENET_EIR_TS_TIMER_SHIFT)
#define ENET_BRD_EIR_TS_TIMER(base) (BITBAND_ACCESS32(&ENET_EIR_REG(base), ENET_EIR_TS_TIMER_SHIFT))

/*! @brief Set the TS_TIMER field to a new value. */
#define ENET_WR_EIR_TS_TIMER(base, value) (ENET_RMW_EIR(base, (ENET_EIR_TS_TIMER_MASK | ENET_EIR_TS_AVAIL_MASK | ENET_EIR_WAKEUP_MASK | ENET_EIR_PLR_MASK | ENET_EIR_UN_MASK | ENET_EIR_RL_MASK | ENET_EIR_LC_MASK | ENET_EIR_EBERR_MASK | ENET_EIR_MII_MASK | ENET_EIR_RXB_MASK | ENET_EIR_RXF_MASK | ENET_EIR_TXB_MASK | ENET_EIR_TXF_MASK | ENET_EIR_GRA_MASK | ENET_EIR_BABT_MASK | ENET_EIR_BABR_MASK), ENET_EIR_TS_TIMER(value)))
#define ENET_BWR_EIR_TS_TIMER(base, value) (BITBAND_ACCESS32(&ENET_EIR_REG(base), ENET_EIR_TS_TIMER_SHIFT) = (value))
/*@}*/

/*!
 * @name Register ENET_EIR, field TS_AVAIL[16] (W1C)
 *
 * Indicates that the timestamp of the last transmitted timing frame is
 * available in the ATSTMP register.
 */
/*@{*/
/*! @brief Read current value of the ENET_EIR_TS_AVAIL field. */
#define ENET_RD_EIR_TS_AVAIL(base) ((ENET_EIR_REG(base) & ENET_EIR_TS_AVAIL_MASK) >> ENET_EIR_TS_AVAIL_SHIFT)
#define ENET_BRD_EIR_TS_AVAIL(base) (BITBAND_ACCESS32(&ENET_EIR_REG(base), ENET_EIR_TS_AVAIL_SHIFT))

/*! @brief Set the TS_AVAIL field to a new value. */
#define ENET_WR_EIR_TS_AVAIL(base, value) (ENET_RMW_EIR(base, (ENET_EIR_TS_AVAIL_MASK | ENET_EIR_TS_TIMER_MASK | ENET_EIR_WAKEUP_MASK | ENET_EIR_PLR_MASK | ENET_EIR_UN_MASK | ENET_EIR_RL_MASK | ENET_EIR_LC_MASK | ENET_EIR_EBERR_MASK | ENET_EIR_MII_MASK | ENET_EIR_RXB_MASK | ENET_EIR_RXF_MASK | ENET_EIR_TXB_MASK | ENET_EIR_TXF_MASK | ENET_EIR_GRA_MASK | ENET_EIR_BABT_MASK | ENET_EIR_BABR_MASK), ENET_EIR_TS_AVAIL(value)))
#define ENET_BWR_EIR_TS_AVAIL(base, value) (BITBAND_ACCESS32(&ENET_EIR_REG(base), ENET_EIR_TS_AVAIL_SHIFT) = (value))
/*@}*/

/*!
 * @name Register ENET_EIR, field WAKEUP[17] (W1C)
 *
 * Read-only status bit to indicate that a magic packet has been detected. Will
 * act only if ECR[MAGICEN] is set.
 */
/*@{*/
/*! @brief Read current value of the ENET_EIR_WAKEUP field. */
#define ENET_RD_EIR_WAKEUP(base) ((ENET_EIR_REG(base) & ENET_EIR_WAKEUP_MASK) >> ENET_EIR_WAKEUP_SHIFT)
#define ENET_BRD_EIR_WAKEUP(base) (BITBAND_ACCESS32(&ENET_EIR_REG(base), ENET_EIR_WAKEUP_SHIFT))

/*! @brief Set the WAKEUP field to a new value. */
#define ENET_WR_EIR_WAKEUP(base, value) (ENET_RMW_EIR(base, (ENET_EIR_WAKEUP_MASK | ENET_EIR_TS_TIMER_MASK | ENET_EIR_TS_AVAIL_MASK | ENET_EIR_PLR_MASK | ENET_EIR_UN_MASK | ENET_EIR_RL_MASK | ENET_EIR_LC_MASK | ENET_EIR_EBERR_MASK | ENET_EIR_MII_MASK | ENET_EIR_RXB_MASK | ENET_EIR_RXF_MASK | ENET_EIR_TXB_MASK | ENET_EIR_TXF_MASK | ENET_EIR_GRA_MASK | ENET_EIR_BABT_MASK | ENET_EIR_BABR_MASK), ENET_EIR_WAKEUP(value)))
#define ENET_BWR_EIR_WAKEUP(base, value) (BITBAND_ACCESS32(&ENET_EIR_REG(base), ENET_EIR_WAKEUP_SHIFT) = (value))
/*@}*/

/*!
 * @name Register ENET_EIR, field PLR[18] (W1C)
 *
 * Indicates a frame was received with a payload length error. See Frame
 * Length/Type Verification: Payload Length Check for more information.
 */
/*@{*/
/*! @brief Read current value of the ENET_EIR_PLR field. */
#define ENET_RD_EIR_PLR(base) ((ENET_EIR_REG(base) & ENET_EIR_PLR_MASK) >> ENET_EIR_PLR_SHIFT)
#define ENET_BRD_EIR_PLR(base) (BITBAND_ACCESS32(&ENET_EIR_REG(base), ENET_EIR_PLR_SHIFT))

/*! @brief Set the PLR field to a new value. */
#define ENET_WR_EIR_PLR(base, value) (ENET_RMW_EIR(base, (ENET_EIR_PLR_MASK | ENET_EIR_TS_TIMER_MASK | ENET_EIR_TS_AVAIL_MASK | ENET_EIR_WAKEUP_MASK | ENET_EIR_UN_MASK | ENET_EIR_RL_MASK | ENET_EIR_LC_MASK | ENET_EIR_EBERR_MASK | ENET_EIR_MII_MASK | ENET_EIR_RXB_MASK | ENET_EIR_RXF_MASK | ENET_EIR_TXB_MASK | ENET_EIR_TXF_MASK | ENET_EIR_GRA_MASK | ENET_EIR_BABT_MASK | ENET_EIR_BABR_MASK), ENET_EIR_PLR(value)))
#define ENET_BWR_EIR_PLR(base, value) (BITBAND_ACCESS32(&ENET_EIR_REG(base), ENET_EIR_PLR_SHIFT) = (value))
/*@}*/

/*!
 * @name Register ENET_EIR, field UN[19] (W1C)
 *
 * Indicates the transmit FIFO became empty before the complete frame was
 * transmitted. A bad CRC is appended to the frame fragment and the remainder of the
 * frame is discarded.
 */
/*@{*/
/*! @brief Read current value of the ENET_EIR_UN field. */
#define ENET_RD_EIR_UN(base) ((ENET_EIR_REG(base) & ENET_EIR_UN_MASK) >> ENET_EIR_UN_SHIFT)
#define ENET_BRD_EIR_UN(base) (BITBAND_ACCESS32(&ENET_EIR_REG(base), ENET_EIR_UN_SHIFT))

/*! @brief Set the UN field to a new value. */
#define ENET_WR_EIR_UN(base, value) (ENET_RMW_EIR(base, (ENET_EIR_UN_MASK | ENET_EIR_TS_TIMER_MASK | ENET_EIR_TS_AVAIL_MASK | ENET_EIR_WAKEUP_MASK | ENET_EIR_PLR_MASK | ENET_EIR_RL_MASK | ENET_EIR_LC_MASK | ENET_EIR_EBERR_MASK | ENET_EIR_MII_MASK | ENET_EIR_RXB_MASK | ENET_EIR_RXF_MASK | ENET_EIR_TXB_MASK | ENET_EIR_TXF_MASK | ENET_EIR_GRA_MASK | ENET_EIR_BABT_MASK | ENET_EIR_BABR_MASK), ENET_EIR_UN(value)))
#define ENET_BWR_EIR_UN(base, value) (BITBAND_ACCESS32(&ENET_EIR_REG(base), ENET_EIR_UN_SHIFT) = (value))
/*@}*/

/*!
 * @name Register ENET_EIR, field RL[20] (W1C)
 *
 * Indicates a collision occurred on each of 16 successive attempts to transmit
 * the frame. The frame is discarded without being transmitted and transmission
 * of the next frame commences. This error can only occur in half-duplex mode.
 */
/*@{*/
/*! @brief Read current value of the ENET_EIR_RL field. */
#define ENET_RD_EIR_RL(base) ((ENET_EIR_REG(base) & ENET_EIR_RL_MASK) >> ENET_EIR_RL_SHIFT)
#define ENET_BRD_EIR_RL(base) (BITBAND_ACCESS32(&ENET_EIR_REG(base), ENET_EIR_RL_SHIFT))

/*! @brief Set the RL field to a new value. */
#define ENET_WR_EIR_RL(base, value) (ENET_RMW_EIR(base, (ENET_EIR_RL_MASK | ENET_EIR_TS_TIMER_MASK | ENET_EIR_TS_AVAIL_MASK | ENET_EIR_WAKEUP_MASK | ENET_EIR_PLR_MASK | ENET_EIR_UN_MASK | ENET_EIR_LC_MASK | ENET_EIR_EBERR_MASK | ENET_EIR_MII_MASK | ENET_EIR_RXB_MASK | ENET_EIR_RXF_MASK | ENET_EIR_TXB_MASK | ENET_EIR_TXF_MASK | ENET_EIR_GRA_MASK | ENET_EIR_BABT_MASK | ENET_EIR_BABR_MASK), ENET_EIR_RL(value)))
#define ENET_BWR_EIR_RL(base, value) (BITBAND_ACCESS32(&ENET_EIR_REG(base), ENET_EIR_RL_SHIFT) = (value))
/*@}*/

/*!
 * @name Register ENET_EIR, field LC[21] (W1C)
 *
 * Indicates a collision occurred beyond the collision window (slot time) in
 * half-duplex mode. The frame truncates with a bad CRC and the remainder of the
 * frame is discarded.
 */
/*@{*/
/*! @brief Read current value of the ENET_EIR_LC field. */
#define ENET_RD_EIR_LC(base) ((ENET_EIR_REG(base) & ENET_EIR_LC_MASK) >> ENET_EIR_LC_SHIFT)
#define ENET_BRD_EIR_LC(base) (BITBAND_ACCESS32(&ENET_EIR_REG(base), ENET_EIR_LC_SHIFT))

