ciaa/firmware_v1/externals/drivers/cortexM4/k60_120/inc/MK60F12_extension.h
/*! @brief Set the LC field to a new value. */
#define ENET_WR_EIMR_LC(base, value) (ENET_RMW_EIMR(base, ENET_EIMR_LC_MASK, ENET_EIMR_LC(value)))
#define ENET_BWR_EIMR_LC(base, value) (BITBAND_ACCESS32(&ENET_EIMR_REG(base), ENET_EIMR_LC_SHIFT) = (value))
/*@}*/

/*!
 * @name Register ENET_EIMR, field EBERR[22] (RW)
 *
 * Corresponds to interrupt source EIR[EBERR] and determines whether an
 * interrupt condition can generate an interrupt. At every module clock, the EIR samples
 * the signal generated by the interrupting source. The corresponding EIR EBERR
 * field reflects the state of the interrupt signal even if the corresponding EIMR
 * field is cleared.
 */
/*@{*/
/*! @brief Read current value of the ENET_EIMR_EBERR field. */
#define ENET_RD_EIMR_EBERR(base) ((ENET_EIMR_REG(base) & ENET_EIMR_EBERR_MASK) >> ENET_EIMR_EBERR_SHIFT)
#define ENET_BRD_EIMR_EBERR(base) (BITBAND_ACCESS32(&ENET_EIMR_REG(base), ENET_EIMR_EBERR_SHIFT))

/*! @brief Set the EBERR field to a new value. */
#define ENET_WR_EIMR_EBERR(base, value) (ENET_RMW_EIMR(base, ENET_EIMR_EBERR_MASK, ENET_EIMR_EBERR(value)))
#define ENET_BWR_EIMR_EBERR(base, value) (BITBAND_ACCESS32(&ENET_EIMR_REG(base), ENET_EIMR_EBERR_SHIFT) = (value))
/*@}*/

/*!
 * @name Register ENET_EIMR, field MII[23] (RW)
 *
 * Corresponds to interrupt source EIR[MII] and determines whether an interrupt
 * condition can generate an interrupt. At every module clock, the EIR samples
 * the signal generated by the interrupting source. The corresponding EIR MII field
 * reflects the state of the interrupt signal even if the corresponding EIMR
 * field is cleared.
 */
/*@{*/
/*! @brief Read current value of the ENET_EIMR_MII field. */
#define ENET_RD_EIMR_MII(base) ((ENET_EIMR_REG(base) & ENET_EIMR_MII_MASK) >> ENET_EIMR_MII_SHIFT)
#define ENET_BRD_EIMR_MII(base) (BITBAND_ACCESS32(&ENET_EIMR_REG(base), ENET_EIMR_MII_SHIFT))

/*! @brief Set the MII field to a new value. */
#define ENET_WR_EIMR_MII(base, value) (ENET_RMW_EIMR(base, ENET_EIMR_MII_MASK, ENET_EIMR_MII(value)))
#define ENET_BWR_EIMR_MII(base, value) (BITBAND_ACCESS32(&ENET_EIMR_REG(base), ENET_EIMR_MII_SHIFT) = (value))
/*@}*/

/*!
 * @name Register ENET_EIMR, field RXB[24] (RW)
 *
 * Corresponds to interrupt source EIR[RXB] and determines whether an interrupt
 * condition can generate an interrupt. At every module clock, the EIR samples
 * the signal generated by the interrupting source. The corresponding EIR RXB field
 * reflects the state of the interrupt signal even if the corresponding EIMR
 * field is cleared.
 */
/*@{*/
/*! @brief Read current value of the ENET_EIMR_RXB field. */
#define ENET_RD_EIMR_RXB(base) ((ENET_EIMR_REG(base) & ENET_EIMR_RXB_MASK) >> ENET_EIMR_RXB_SHIFT)
#define ENET_BRD_EIMR_RXB(base) (BITBAND_ACCESS32(&ENET_EIMR_REG(base), ENET_EIMR_RXB_SHIFT))

/*! @brief Set the RXB field to a new value. */
#define ENET_WR_EIMR_RXB(base, value) (ENET_RMW_EIMR(base, ENET_EIMR_RXB_MASK, ENET_EIMR_RXB(value)))
#define ENET_BWR_EIMR_RXB(base, value) (BITBAND_ACCESS32(&ENET_EIMR_REG(base), ENET_EIMR_RXB_SHIFT) = (value))
/*@}*/

/*!
 * @name Register ENET_EIMR, field RXF[25] (RW)
 *
 * Corresponds to interrupt source EIR[RXF] and determines whether an interrupt
 * condition can generate an interrupt. At every module clock, the EIR samples
 * the signal generated by the interrupting source. The corresponding EIR RXF field
 * reflects the state of the interrupt signal even if the corresponding EIMR
 * field is cleared.
 */
/*@{*/
/*! @brief Read current value of the ENET_EIMR_RXF field. */
#define ENET_RD_EIMR_RXF(base) ((ENET_EIMR_REG(base) & ENET_EIMR_RXF_MASK) >> ENET_EIMR_RXF_SHIFT)
#define ENET_BRD_EIMR_RXF(base) (BITBAND_ACCESS32(&ENET_EIMR_REG(base), ENET_EIMR_RXF_SHIFT))

/*! @brief Set the RXF field to a new value. */
#define ENET_WR_EIMR_RXF(base, value) (ENET_RMW_EIMR(base, ENET_EIMR_RXF_MASK, ENET_EIMR_RXF(value)))
#define ENET_BWR_EIMR_RXF(base, value) (BITBAND_ACCESS32(&ENET_EIMR_REG(base), ENET_EIMR_RXF_SHIFT) = (value))
/*@}*/

/*!
 * @name Register ENET_EIMR, field TXB[26] (RW)
 *
 * Corresponds to interrupt source EIR[TXB] and determines whether an interrupt
 * condition can generate an interrupt. At every module clock, the EIR samples
 * the signal generated by the interrupting source. The corresponding EIR TXF field
 * reflects the state of the interrupt signal even if the corresponding EIMR
 * field is cleared.
 *
 * Values:
 * - 0 - The corresponding interrupt source is masked.
 * - 1 - The corresponding interrupt source is not masked.
 */
/*@{*/
/*! @brief Read current value of the ENET_EIMR_TXB field. */
#define ENET_RD_EIMR_TXB(base) ((ENET_EIMR_REG(base) & ENET_EIMR_TXB_MASK) >> ENET_EIMR_TXB_SHIFT)
#define ENET_BRD_EIMR_TXB(base) (BITBAND_ACCESS32(&ENET_EIMR_REG(base), ENET_EIMR_TXB_SHIFT))

/*! @brief Set the TXB field to a new value. */
#define ENET_WR_EIMR_TXB(base, value) (ENET_RMW_EIMR(base, ENET_EIMR_TXB_MASK, ENET_EIMR_TXB(value)))
#define ENET_BWR_EIMR_TXB(base, value) (BITBAND_ACCESS32(&ENET_EIMR_REG(base), ENET_EIMR_TXB_SHIFT) = (value))
/*@}*/

/*!
 * @name Register ENET_EIMR, field TXF[27] (RW)
 *
 * Corresponds to interrupt source EIR[TXF] and determines whether an interrupt
 * condition can generate an interrupt. At every module clock, the EIR samples
 * the signal generated by the interrupting source. The corresponding EIR TXF field
 * reflects the state of the interrupt signal even if the corresponding EIMR
 * field is cleared.
 *
 * Values:
 * - 0 - The corresponding interrupt source is masked.
 * - 1 - The corresponding interrupt source is not masked.
 */
/*@{*/
/*! @brief Read current value of the ENET_EIMR_TXF field. */
#define ENET_RD_EIMR_TXF(base) ((ENET_EIMR_REG(base) & ENET_EIMR_TXF_MASK) >> ENET_EIMR_TXF_SHIFT)
#define ENET_BRD_EIMR_TXF(base) (BITBAND_ACCESS32(&ENET_EIMR_REG(base), ENET_EIMR_TXF_SHIFT))

/*! @brief Set the TXF field to a new value. */
#define ENET_WR_EIMR_TXF(base, value) (ENET_RMW_EIMR(base, ENET_EIMR_TXF_MASK, ENET_EIMR_TXF(value)))
#define ENET_BWR_EIMR_TXF(base, value) (BITBAND_ACCESS32(&ENET_EIMR_REG(base), ENET_EIMR_TXF_SHIFT) = (value))
/*@}*/

/*!
 * @name Register ENET_EIMR, field GRA[28] (RW)
 *
 * Corresponds to interrupt source EIR[GRA] and determines whether an interrupt
 * condition can generate an interrupt. At every module clock, the EIR samples
 * the signal generated by the interrupting source. The corresponding EIR GRA field
 * reflects the state of the interrupt signal even if the corresponding EIMR
 * field is cleared.
 *
 * Values:
 * - 0 - The corresponding interrupt source is masked.
 * - 1 - The corresponding interrupt source is not masked.
 */
/*@{*/
/*! @brief Read current value of the ENET_EIMR_GRA field. */
#define ENET_RD_EIMR_GRA(base) ((ENET_EIMR_REG(base) & ENET_EIMR_GRA_MASK) >> ENET_EIMR_GRA_SHIFT)
#define ENET_BRD_EIMR_GRA(base) (BITBAND_ACCESS32(&ENET_EIMR_REG(base), ENET_EIMR_GRA_SHIFT))

/*! @brief Set the GRA field to a new value. */
#define ENET_WR_EIMR_GRA(base, value) (ENET_RMW_EIMR(base, ENET_EIMR_GRA_MASK, ENET_EIMR_GRA(value)))
#define ENET_BWR_EIMR_GRA(base, value) (BITBAND_ACCESS32(&ENET_EIMR_REG(base), ENET_EIMR_GRA_SHIFT) = (value))
/*@}*/

/*!
 * @name Register ENET_EIMR, field BABT[29] (RW)
 *
 * Corresponds to interrupt source EIR[BABT] and determines whether an interrupt
 * condition can generate an interrupt. At every module clock, the EIR samples
 * the signal generated by the interrupting source. The corresponding EIR BABT
 * field reflects the state of the interrupt signal even if the corresponding EIMR
 * field is cleared.
 *
 * Values:
 * - 0 - The corresponding interrupt source is masked.
 * - 1 - The corresponding interrupt source is not masked.
 */
/*@{*/
/*! @brief Read current value of the ENET_EIMR_BABT field. */
#define ENET_RD_EIMR_BABT(base) ((ENET_EIMR_REG(base) & ENET_EIMR_BABT_MASK) >> ENET_EIMR_BABT_SHIFT)
#define ENET_BRD_EIMR_BABT(base) (BITBAND_ACCESS32(&ENET_EIMR_REG(base), ENET_EIMR_BABT_SHIFT))

/*! @brief Set the BABT field to a new value. */
#define ENET_WR_EIMR_BABT(base, value) (ENET_RMW_EIMR(base, ENET_EIMR_BABT_MASK, ENET_EIMR_BABT(value)))
#define ENET_BWR_EIMR_BABT(base, value) (BITBAND_ACCESS32(&ENET_EIMR_REG(base), ENET_EIMR_BABT_SHIFT) = (value))
/*@}*/

/*!
 * @name Register ENET_EIMR, field BABR[30] (RW)
 *
 * Corresponds to interrupt source EIR[BABR] and determines whether an interrupt
 * condition can generate an interrupt. At every module clock, the EIR samples
 * the signal generated by the interrupting source. The corresponding EIR BABR
 * field reflects the state of the interrupt signal even if the corresponding EIMR
 * field is cleared.
 *
 * Values:
 * - 0 - The corresponding interrupt source is masked.
 * - 1 - The corresponding interrupt source is not masked.
 */
/*@{*/
/*! @brief Read current value of the ENET_EIMR_BABR field. */
#define ENET_RD_EIMR_BABR(base) ((ENET_EIMR_REG(base) & ENET_EIMR_BABR_MASK) >> ENET_EIMR_BABR_SHIFT)
#define ENET_BRD_EIMR_BABR(base) (BITBAND_ACCESS32(&ENET_EIMR_REG(base), ENET_EIMR_BABR_SHIFT))

/*! @brief Set the BABR field to a new value. */
#define ENET_WR_EIMR_BABR(base, value) (ENET_RMW_EIMR(base, ENET_EIMR_BABR_MASK, ENET_EIMR_BABR(value)))
#define ENET_BWR_EIMR_BABR(base, value) (BITBAND_ACCESS32(&ENET_EIMR_REG(base), ENET_EIMR_BABR_SHIFT) = (value))
/*@}*/

